In [54]:
%%time
#Импорт CSV

import pandas as pd
import numpy as np

file_name = 'netology-ipynb/power.csv'

#уменьшение памяти в 2 раза
#data = pd.read_csv(file_name, dtype={'year':np.int16, 'category':np.int8, 'quantity':np.float32})

data = pd.read_csv(file_name)

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB
Wall time: 708 ms

In [18]:
data.head(7)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1
5  Belgium  2011      25.0         1
6  Belgium  2010      22.0         1

In [19]:
data.tail(7)

          country  year  quantity  category
1189475  Viet Nam  2014     300.0        71
1189476  Viet Nam  2013      92.0        71
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [24]:
len(data)

1189482

In [21]:
data.keys()

Index(['country', 'year', 'quantity', 'category'], dtype='object')

In [26]:
data.shape
#строки - столбцы

(1189482, 4)

In [36]:
%%time
#Внести расчетные данные

data['new_year'] = data['year'] + 100
data.head()

Wall time: 20 ms

   country  year  quantity  category  new_year
0  Austria  1996       5.0         1      2096
1  Austria  1995      17.0         1      2095
2  Belgium  2014       0.0         1      2114
3  Belgium  2013       0.0         1      2113
4  Belgium  2012      35.0         1      2112

In [49]:
max(data['category'])

71